{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "qwen3",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 8,
  "lora_dropout": 0.0,
  "modules_to_save": [
    "lm_head"
  ],
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "q_proj",
    "v_proj"
  ],
  "task_type": "CAUSAL_LM"
}